*** マーク機能に関連するメソッド
    | メソッド                 | 説明                                                                                              |
    | void mark(int readlimit) | 入力ストリームの現在位置にマークを設定する ~readLimit~ はマーク後に読み取ることのできる文字の上限 |
    | void reset()             | 入力ストリームの読み取り位置を最後に設定したマークに移動する                                      |
    | long skip(long n)        | 入力ストリームからnバイトのデータをスキップして破棄する                                           |
    - ~mark~ せずに ~reset~ すると、 ~IOException~ がスローされる
#+BEGIN_SRC java :results output :exports both :classname Foo
import java.io.*;

public class Foo {
  public static void main(String[] args) {
    // 0 1 2 3 4 5 6 7
    // a b c d e f g h
    // a x c x x f
    try(BufferedReader in = new BufferedReader(new FileReader("./sample/sample.txt"))) {
      for(int i = 0; i < 3; i++) {
        in.skip(i);
        System.out.print((char) in.read());
      }
      in.reset(); // <- markせずにreset
    } catch (IOException e) {
      System.out.println();
      System.out.println(e);
    }
  }
}
#+END_SRC

#+RESULTS:
: acf
: java.io.IOException: Stream not marked
#+BEGIN_SRC java :results output :exports both :classname Foo
import java.io.*;

public class Foo {
  public static void main(String[] args) {
    // 0 1 2 3 4 5 6 7
    // a b c d e f g h
    try(BufferedReader in = new BufferedReader(new FileReader("./sample/sample.txt"))) {
                                                  // -> x 
      System.out.print(" " + (char) in.read());   // a  b  c  d  e  f  g  h
                                                  //
                                                  //    -> x
      System.out.print(" " + (char) in.read());   // a  b  c  d  e  f  g  h
      in.mark(1);                                 //       m
                                                  //
                                                  //         -------------> x
      System.out.print(" " + in.readLine());      // a  b  c  d  e  f  g  h
                                                  //
                                                  //       x <-------------
      in.reset();                                 // a  b  c  d  e  f  g  h
      System.out.println(" " + (char) in.read());


    } catch (IOException e) {
      System.out.println();
      System.out.println(e);
    }
  }
}
#+END_SRC

#+RESULTS:
:  a b cdefgh c
** ~path.getXxx()~
#+BEGIN_SRC java :results output :exports both :classname Foo
import java.nio.file.Path;
import java.nio.file.Paths;

public class Foo {
  public static void main(String[] args) {
    Path path = Paths.get("/home/ikoamu/atmos-it/junk.org");
    System.out.printf(
      "%s, %s, %s, %d\n", path.getRoot(), path.getName(0), path.getFileName(), path.getNameCount());
    Path path2 = Paths.get("./sample/sample.txt");
    System.out.printf(
      "%s, %s, %s, %d\n", path2.getRoot(), path2.getName(0), path2.getFileName(), path2.getNameCount());
    Path path3 = Paths.get("C://x//y//z");
    System.out.printf(
      "%s, %s, %s, %d\n", path3.getRoot(), path3.getName(0), path3.getFileName(), path3.getNameCount());
    // 黒本だと
    // "C:\\x\\y\\z" 
    // getRoot()      -> C:\
    // getName(0)     -> x
    // getFileName()  -> z
    // getNameCount() -> 3
  }
}
#+END_SRC

#+RESULTS:
: /, home, junk.org, 4
: null, ., sample.txt, 3
: null, C:, z, 4
** ~resolveメソッド~
   - 引数
     - 相対パス
       2つのパスを結合したパスを返す
     - 絶対パス
       渡されたパスそのものを返す
     - 空
       自分自身を表すパスを返す
#+BEGIN_SRC java :results output :exports both :classname Foo
import java.nio.file.Path;
import java.nio.file.Paths;

public class Foo {
  public static void main(String[] args) {
    Path path1 = Paths.get("/home/ikoamu/junk/2019-05-15-144333.org");
    Path path2 = Paths.get("/var/lib/gems");
    Path path3 = Paths.get("sample");
    System.out.println(path1.resolve(path2));
    System.out.println(path3.resolve(path2));
    System.out.println(path2.resolve(path3));
  }
}
#+END_SRC     

#+RESULTS:
: /var/lib/gems
: /var/lib/gems
: /var/lib/gems/sample
** ~resolveSiblingメソッド~
   - 引数
     - 相対パス
       現在のパスの親ディレクトリからのパスとして解決したいパスを返す
     - 絶対パス
       渡されたパスそのものを返す
   - ただし、メソッド呼び出し側のPathオブジェクトが表すパスが相対パスが絶対パスの場合には、
   引数で渡されたパスそのものを返す
#+BEGIN_SRC java :results output :exports both :classname Foo
import java.nio.file.Path;
import java.nio.file.Paths;

public class Foo {
  public static void main(String[] args) {
    Path path2 = Paths.get("/var/lib/gems");
    Path path3 = Paths.get("sample");
    System.out.println(path3.resolveSibling(path2));
    System.out.println(path2.resolveSibling(path3));
  }
}
#+END_SRC     

#+RESULTS:
: /var/lib/gems
: /var/lib/sample
** ~normalize~
#+BEGIN_SRC java :results output :exports both :classname Foo
import java.nio.file.Path;
import java.nio.file.Paths;

public class Foo {
  public static void main(String[] args) {
    Path path = Paths.get("/home/./ikoamu/../ikoamu/study/./../study/docker/node-playground/docker-compose.yml");
    System.out.println(path);
    path.normalize();
    System.out.println(path);
    System.out.println(path.normalize());
  }
}
#+END_SRC   

#+RESULTS:
: /home/./ikoamu/../ikoamu/study/./../study/docker/node-playground/docker-compose.yml
: /home/./ikoamu/../ikoamu/study/./../study/docker/node-playground/docker-compose.yml
: /home/ikoamu/study/docker/node-playground/docker-compose.yml
** ~relativize~
#+BEGIN_SRC java :results output :exports both :classname Foo
import java.nio.file.Path;
import java.nio.file.Paths;

public class Foo {
  public static void main(String[] args) {
    Path path1 = Paths.get("/a/b/c/d.txt");
    Path path2 = Paths.get("/a/b/e/f.txt");
    System.out.println(path1.relativize(path2)); // path1 から path2へ
  }
}
#+END_SRC   

#+RESULTS:
: ../../e/f.txt
